# Завдання 1
# Реалізуйте клас стеку для роботи з рядками (стек рядків).
# Стек має бути фіксованого розміру. Реалізуйте набір операцій
# для роботи зі стеком:
# o розміщення рядка у стек;
# o виштовхування рядка зі стеку;
# o підрахунок кількості рядків у стеку;
# o перевірку, чи порожній стек;
# o перевірку, чи повний стек;
# o очищення стеку;
# o отримання значення без виштовхування
# верхнього рядка зі стеку.
# На старті додатка відобразіть меню, в якому користувач
# може вибрати необхідну операцію.

#Завдання 2
#Змініть стек із першого завдання таким чином, щоб його
#розмір був нефіксованим.

class Stack:
    def __init__(self):
        self.items = []  # Створення порожнього списку для зберігання елементів стеку

    def is_empty(self):
        return not self.items  # Перевірка на пустоту: True, якщо стек порожній

    def push(self, item):
        self.items.append(item)  # Додавання елементу до вершини стеку

    def pop(self):
        if not self.is_empty():
            return self.items.pop()  # Вилучення та повернення верхнього елементу
        else:
            return "Стек порожній. Неможливо виштовхнути елемент."

    def peek(self):
        if not self.is_empty():
            return self.items[-1]  # Повернення верхнього елементу стеку без вилучення
        else:
            return "Стек порожній. Відсутній верхній елемент."

    def size(self):
        return len(self.items)  # Повернення кількості елементів у стеці

    def clear(self):
        self.items = []  # Очищення стеку

    def get_top_without_pop(self):
        if not self.is_empty():
            return self.items[-1]  # Отримання значення верхнього елементу без виштовхування
        else:
            return "Стек порожній. Відсутній верхній елемент."


# Створення екземпляра класу Stack
stack = Stack()

while True:
    print("\nМеню:")
    print("1. Додати елемент у стек")
    print("2. Виштовхнути елемент зі стеку")
    print("3. Підрахунок кількості елементів у стеці")
    print("4. Перевірка, чи порожній стек")
    print("5. Очищення стеку")
    print("6. Отримання значення верхнього елементу без виштовхування")
    print("7. Вихід")

    choice = input("Введіть номер операції: ")

    if choice == "1":
        item = input("Введіть значення для додавання у стек: ")
        stack.push(item)
    elif choice == "2":
        print("Виштовхнутий елемент:", stack.pop())
    elif choice == "3":
        print("Кількість елементів у стеці:", stack.size())
    elif choice == "4":
        print("Чи порожній стек:", stack.is_empty())
    elif choice == "5":
        stack.clear()
        print("Стек очищено.")
    elif choice == "6":
        print("Значення верхнього елементу без виштовхування:", stack.get_top_without_pop())
    elif choice == "7":
        print("Дякую за використання програми. Вихід.")
        break
    else:
        print("Невірний вибір. Спробуйте ще раз.")

